; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite3 - satellite
	instrument9 - instrument
	instrument10 - instrument
	satellite4 - satellite
	instrument11 - instrument
	instrument12 - instrument
	instrument13 - instrument
	satellite5 - satellite
	instrument14 - instrument
	infrared1 - mode
	image0 - mode
	GroundStation2 - direction
	GroundStation5 - direction
	Star1 - direction
	GroundStation6 - direction
	GroundStation3 - direction
	GroundStation0 - direction
	Star7 - direction
	GroundStation4 - direction
	Star8 - direction
	Star9 - direction
	Planet10 - direction
	Planet11 - direction
	Star12 - direction
	Planet13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 image0)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 image0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 GroundStation6)
	(supports instrument2 image0)
	(supports instrument2 infrared1)
	(calibration_target instrument2 GroundStation5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation5)
	(supports instrument3 image0)
	(calibration_target instrument3 Star7)
	(supports instrument4 image0)
	(calibration_target instrument4 GroundStation2)
	(supports instrument5 infrared1)
	(supports instrument5 image0)
	(calibration_target instrument5 Star1)
	(calibration_target instrument5 GroundStation5)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star12)
	(supports instrument6 image0)
	(supports instrument6 infrared1)
	(calibration_target instrument6 GroundStation3)
	(calibration_target instrument6 GroundStation6)
	(supports instrument7 infrared1)
	(supports instrument7 image0)
	(calibration_target instrument7 GroundStation3)
	(calibration_target instrument7 Star7)
	(supports instrument8 infrared1)
	(calibration_target instrument8 GroundStation3)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation3)
	(supports instrument9 infrared1)
	(supports instrument9 image0)
	(calibration_target instrument9 GroundStation6)
	(supports instrument10 infrared1)
	(supports instrument10 image0)
	(calibration_target instrument10 Star7)
	(calibration_target instrument10 GroundStation0)
	(on_board instrument9 satellite3)
	(on_board instrument10 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star1)
	(supports instrument11 infrared1)
	(supports instrument11 image0)
	(calibration_target instrument11 GroundStation3)
	(supports instrument12 image0)
	(supports instrument12 infrared1)
	(calibration_target instrument12 GroundStation3)
	(supports instrument13 infrared1)
	(supports instrument13 image0)
	(calibration_target instrument13 Star7)
	(calibration_target instrument13 GroundStation0)
	(on_board instrument11 satellite4)
	(on_board instrument12 satellite4)
	(on_board instrument13 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star8)
	(supports instrument14 infrared1)
	(supports instrument14 image0)
	(calibration_target instrument14 GroundStation4)
	(on_board instrument14 satellite5)
	(power_avail satellite5)
	(pointing satellite5 GroundStation2)
)
(:goal (and
	(pointing satellite1 Star7)
	(pointing satellite5 Star8)
	(have_image Star8 image0)
	(have_image Star9 infrared1)
	(have_image Planet10 infrared1)
	(have_image Planet11 infrared1)
	(have_image Star12 infrared1)
	(have_image Planet13 image0)
	(have_image Star14 image0)
))

)

; plan
1. (turn_to satellite1 star7 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star7)
   goals met: 1 of 9
2. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 1 of 9
3. (calibrate satellite0 instrument2 groundstation5)
   added: (calibrated instrument2)
   goals met: 1 of 9
4. (turn_to satellite0 star12 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 star12)
   goals met: 1 of 9
5. (take_image satellite0 star12 instrument2 infrared1)
   added: (have_image star12 infrared1)
   goals met: 2 of 9
6. (turn_to satellite0 planet13 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 planet13)
   goals met: 2 of 9
7. (take_image satellite0 planet13 instrument2 image0)
   added: (have_image planet13 image0)
   goals met: 3 of 9
8. (turn_to satellite0 planet11 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet11)
   goals met: 3 of 9
9. (take_image satellite0 planet11 instrument2 infrared1)
   added: (have_image planet11 infrared1)
   goals met: 4 of 9
10. (turn_to satellite0 planet10 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet10)
   goals met: 4 of 9
11. (take_image satellite0 planet10 instrument2 infrared1)
   added: (have_image planet10 infrared1)
   goals met: 5 of 9
12. (turn_to satellite0 star14 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 star14)
   goals met: 5 of 9
13. (take_image satellite0 star14 instrument2 image0)
   added: (have_image star14 image0)
   goals met: 6 of 9
14. (turn_to satellite0 star8 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star8)
   goals met: 6 of 9
15. (take_image satellite0 star8 instrument2 image0)
   added: (have_image star8 image0)
   goals met: 7 of 9
16. (turn_to satellite0 star9 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star9)
   goals met: 7 of 9
17. (take_image satellite0 star9 instrument2 infrared1)
   added: (have_image star9 infrared1)
   goals met: 8 of 9
18. (turn_to satellite5 star8 groundstation2)
   deleted: (pointing satellite5 groundstation2)
   added: (pointing satellite5 star8)
   goals met: 9 of 9
